app/controllers/books_controller.rb

  def create
    if new_book.save
---
INSERT INTO "books" ("title", "isbn", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["title", "Leonardo Da Vinci"], ["isbn", "1501139150"], ["created_at", "2017-11-15 20:14:52.173187"], ["updated_at", "2017-11-15 20:14:52.173187"], ["category_id", 2]]

  def load_books
    @books = Book.all
---
SELECT "books".* FROM "books"

  def load_book
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]